using FThingSoftware.InFunityScript;
using Cysharp.Threading.Tasks;

public class RunMelos_03 : Scenario
{
    public override async UniTask Content()
    {
        await text("", "メロスは、単純な男であった。買い物を、背負ったままで、のそのそ王城にはいって行った。");
        await text("", "たちまち彼は、巡邏じゅんらの警吏に捕縛された。調べられて、メロスの懐中からは短剣が出て来たので、騒ぎが大きくなってしまった。メロスは、王の前に引き出された。");

        await text("王", "「この短刀で何をするつもりであったか。言え！」");
        await text("", "暴君ディオニスは静かに、けれども威厳を以もって問いつめた。その王の顔は蒼白そうはくで、眉間みけんの皺しわは、刻み込まれたように深かった。");
        await text("メロス", "「市を暴君の手から救うのだ。」");
        await text("ディオニス", "「おまえがか？」");
        await text("ディオニス", "「仕方の無いやつじゃ。おまえには、わしの孤独がわからぬ。」");
        await text("メロス", "「言うな！」");
        await text("メロス", "「人の心を疑うのは、最も恥ずべき悪徳だ。王は、民の忠誠をさえ疑って居られる。」");
        await text("ディオニス", "「疑うのが、正当の心構えなのだと、わしに教えてくれたのは、おまえたちだ。人の心は、あてにならない。人間は、もともと私慾のかたまりさ。信じては、ならぬ。」");
        await text("", "暴君は落着いて呟つぶやき、ほっと溜息ためいきをついた。");
        await text("ディオニス", "「わしだって、平和を望んでいるのだが。」");
        await text("メロス", "「なんの為の平和だ。自分の地位を守る為か。」");
        await text("メロス", "「罪の無い人を殺して、何が平和だ。」");

        await text("ディオニス", "「だまれ、下賤げせんの者。」\n王は、さっと顔を挙げて報いた。");
        await text("ディオニス", "「口では、どんな清らかな事でも言える。わしには、人の腹綿の奥底が見え透いてならぬ。おまえだって、いまに、磔はりつけになってから、泣いて詫わびたって聞かぬぞ。」");
        await text("メロス", "「ああ、王は悧巧りこうだ。自惚うぬぼれているがよい。私は、ちゃんと死ぬる覚悟で居るのに。命乞いなど決してしない。ただ、――」");
        await text("", "と言いかけて、メロスは足もとに視線を落し瞬時ためらい、");
        await text("メロス", "「ただ、私に情をかけたいつもりなら、処刑までに三日間の日限を与えて下さい。」");
        await text("メロス", "たった一人の妹に、亭主を持たせてやりたいのです。三日のうちに、私は村で結婚式を挙げさせ、必ず、ここへ帰って来ます。」");
        await text("", "「ばかな。」と暴君は、嗄しわがれた声で低く笑った。");
        await text("ディオニス", "「とんでもない嘘うそを言うわい。逃がした小鳥が帰って来るというのか。」");
        await text("メロス", "「そうです。帰って来るのです。」メロスは必死で言い張った。");
        await text("メロス", "「私は約束を守ります。私を、三日間だけ許して下さい。妹が、私の帰りを待っているのだ。」");
        await text("メロス", "「そんなに私を信じられないならば、よろしい、この市にセリヌンティウスという石工がいます。私の無二の友人だ。」");
        await text("メロス", "「あれを、人質としてここに置いて行こう。私が逃げてしまって、三日目の日暮まで、ここに帰って来なかったら、あの友人を絞め殺して下さい。たのむ、そうして下さい。」");
        await text("", "それを聞いて王は、残虐な気持で、そっと北叟笑ほくそえんだ。生意気なことを言うわい。どうせ帰って来ないにきまっている。この嘘つきに騙だまされた振りして、放してやるのも面白い。");
        await text("", "そうして身代りの男を、三日目に殺してやるのも気味がいい。人は、これだから信じられぬと、わしは悲しい顔して、その身代りの男を磔刑に処してやるのだ。」");
        await text("", "世の中の、正直者とかいう奴輩やつばらにうんと見せつけてやりたいものさ。");
        await text("ディオニス", "「願いを、聞いた。その身代りを呼ぶがよい。三日目には日没までに帰って来い。」");
        await text("ディオニス", "「おくれたら、その身代りを、きっと殺すぞ。ちょっとおくれて来るがいい。おまえの罪は、永遠にゆるしてやろうぞ。」");
        await text("メロス", "「なに、何をおっしゃる。」");
        await text("ディオニス", "「はは。いのちが大事だったら、おくれて来い。おまえの心は、わかっているぞ。」");

        await text("", "メロスは口惜しく、地団駄じだんだ踏んだ。ものも言いたくなくなった。");
        await text("", "竹馬の友、セリヌンティウスは、深夜、王城に召された。暴君ディオニスの面前で、佳よき友と佳き友は、二年ぶりで相逢うた。");
        await text("", "メロスは、友に一切の事情を語った。セリヌンティウスは無言で首肯うなずき、メロスをひしと抱きしめた。");
        await text("", "友と友の間は、それでよかった。セリヌンティウスは、縄打たれた。メロスは、すぐに出発した。初夏、満天の星である。");

        await sys_return();
        return;
    }
}